FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/ИсправлениеОшибокБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ИсправлениеОшибокБД</Name>
			<Comment>Исправление ошибок базы данных</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДвиженияНепроведенныхДокументов</Name>
					<Comment>Движения непроведенных документов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесоответствиеБазовогоКоличества</Name>
					<Comment>Несоответствие базового количества</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкиПересчетаЦенИСумм</Name>
					<Comment>Ошибки пересчета цен и сумм</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроведенныеДокументыБезДвижений</Name>
					<Comment>Проведенные документы без движений</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасхождениеТоварныхРегистров</Name>
					<Comment>Расхождение товарных регистров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадвоенныеДвижения</Name>
					<Comment>Задвоенные движения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаСостояния</Name>
					<Comment>Строка состояния</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индикатор</Name>
					<Comment>Индикатор</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасхождениеРегистрацииИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
					<Comment>Состав</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Comment>Выбран</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Comment>Ссылка на документ</Comment>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Провести</Name>
							<Comment>Флаг проведения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьДвижения</Name>
							<Comment>Флаг удаления движений</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПересчитатьКоличество</Name>
							<Comment>Флаг пересчета количества</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПересчитатьСумму</Name>
							<Comment>Флаг пересчета суммы</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьРегистрацию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:ExchangePlanRef.УдаленныеПодразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Не хранится на складах, используется для отнесения суммы услуг на себестоимость или доходы и расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
					<Comment>Вид ТМЦ, хранимый на складе и возвращаемый поставщику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
					<Comment>Вид ТМЦ не хранимый на складе и предназначенный для группового прихода / расхода номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
					<Comment>Прочие активы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
					<Comment>Шины</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диски</Name>
					<Comment>Диски</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерныеАгрегаты</Name>
					<Comment>Номерные агрегаты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛКМ</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опции</Name>
					<Comment>Опции автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автомобили</Name>
					<Comment>Автомобили</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/ИсправлениеОшибокБД/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
///////////////////////////////////////////////////////////////////////	
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
///////////////////////////////////////////////////////////////////////

// заполняет таблицу состава обработки
Процедура ЗаполнитьСостав(ТаблицаДокументов,ДействиеСДокументом)
	ВсегоСтрок=ТаблицаДокументов.Количество(); Сч=0;
	КолонкаУзел = ТаблицаДокументов.Колонки.Найти("Узел"); 
	Если КолонкаУзел = Неопределено Тогда
		ТаблицаДокументов.Колонки.Добавить("Узел");
	КонецЕсли;
	Для Каждого СтрокаДок Из ТаблицаДокументов Цикл
		Индикатор=Цел((Сч/ВсегоСтрок)*100);
		СтрокаСостав=Состав.НайтиСтроки(Новый Структура("Документ,Узел",СтрокаДок.Документ,СтрокаДок.Узел));
		Если СтрокаСостав.Количество() = 0 Тогда
			СтрокаСостав=Состав.Добавить();
			СтрокаСостав.Выбран=Истина;
			СтрокаСостав.Документ=СтрокаДок.Документ;
			Если РасхождениеРегистрацииИзменений Тогда
			    СтрокаСостав.Узел = СтрокаДок.Узел;
			КонецЕсли; 
		КонецЕсли;
		СтрокаСостав[ДействиеСДокументом]=Истина;
		Сч=Сч+1;
	КонецЦикла;
	Индикатор=100;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////	
// ПОИСК
///////////////////////////////////////////////////////////////////////

// непроведенные документы с движениями
Функция НайтиНеПроведенныеДокументыСДвижениями()
	ТекстЗапроса="";
	Для Каждого РегистрНакопления Из Метаданные.РегистрыНакопления Цикл
		ТекстЗапроса=ТекстЗапроса+"
		|"+?(ПустаяСтрока(ТекстЗапроса),"","ОБЪЕДИНИТЬ")+"
		|
		|ВЫБРАТЬ
		|	Истина КАК Выбран,
		|	ТаблицаОборотов.Регистратор КАК Документ
		|ИЗ
		|	РегистрНакопления."+РегистрНакопления.Имя+".Обороты(,,Регистратор) КАК ТаблицаОборотов
		|ГДЕ
		|    НЕ ТаблицаОборотов.Регистратор.Проведен";
		ОбработкаПрерыванияПользователя();
	КонецЦикла;
	Запрос=Новый Запрос(ТекстЗапроса);
	ТаблицаДокументов=Запрос.Выполнить().Выгрузить();
	ТаблицаДокументов.Свернуть("Выбран,Документ","");
	Возврат ТаблицаДокументов;
КонецФункции


// проведенные документы без движения
Функция НайтиПроведенныеДокументыБезДвижений()
	ТаблицаДокументов=Новый ТаблицаЗначений();
	ТаблицаДокументов.Колонки.Добавить("Выбран");
	ТаблицаДокументов.Колонки.Добавить("Документ");
	ВсегоСтрок=Метаданные.Документы.Количество(); Сч=0; Индикатор=0;
	Для Каждого МетДок Из Метаданные.Документы Цикл
		ОбработкаПрерыванияПользователя();
		СтрокаСостояния="Поиск проведенных документов без движений ("+МетДок.Синоним+")";
		СтрПоля=""; СтрСоединения=""; СтрГДЕ=""; Сч=Сч+1;
		Индикатор=Цел((Сч/ВсегоСтрок)*100);
		
		// исключим некоторые документы
		Если Найти(",ИзменениеЦен,Переоценка,",","+МетДок.Имя+",")>0 Тогда Продолжить; КонецЕсли;
		
		Для Каждого Регистр Из МетДок.Движения Цикл
			// рассматриваем только регистры накопления
			Попытка Рег=РегистрыНакопления[Регистр.Имя]; Исключение Продолжить; КонецПопытки;
			СтрПоля=СтрПоля+"
			|	,"+Регистр.Имя+".Регистратор КАК Регистратор"+Регистр.Имя;
			
			СтрСоединения=СтрСоединения+"
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления."+Регистр.Имя+" КАК "+Регистр.Имя+"
			|	ПО "+Регистр.Имя+".Регистратор=Док.Ссылка";
			
			СтрГДЕ=СтрГДЕ+"
			|	И "+Регистр.Имя+".Регистратор ЕСТЬ NULL";
			ОбработкаПрерыванияПользователя();
		КонецЦикла;
		// если нет регистров, то документ не рассматриваем
		Если ПустаяСтрока(СтрПоля) И ПустаяСтрока(СтрСоединения) И ПустаяСтрока(СтрГДЕ) Тогда Продолжить; КонецЕсли;
		
		// формируем текст запроса
		ТекстЗапроса="
		|ВЫБРАТЬ
		|	Док.Ссылка КАК Документ
		|"+СтрПоля+"
		|
		|ИЗ
		|	Документ."+МетДок.Имя+" КАК Док
		|"+СтрСоединения+"
		|
		|ГДЕ
		|	Док.Проведен
		|"+СтрГДЕ;
		Запрос=Новый Запрос(ТекстЗапроса);
		ТаблицаЗапроса=Запрос.Выполнить().Выгрузить();
		Если ТаблицаЗапроса.Количество()>0 Тогда
			Для Каждого СтрокаЗапрос Из ТаблицаЗапроса Цикл
				НоваяСтрока=ТаблицаДокументов.Добавить();
				НоваяСтрока.Выбран=Истина;
				НоваяСтрока.Документ=СтрокаЗапрос.Документ;
				ОбработкаПрерыванияПользователя();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаСостояния="Обработка данных";
	ТаблицаДокументов.Свернуть("Выбран,Документ","");
	Возврат ТаблицаДокументов;
КонецФункции

// поиск расхождений движений между регистрами остатки, партии, продажи
Функция НайтиРасхожденияТоварныхРегистров()
	ТаблицаДокументов=Новый ТаблицаЗначений();
	ТаблицаДокументов.Колонки.Добавить("Выбран");
	ТаблицаДокументов.Колонки.Добавить("Документ");
	Индикатор=0;
	
	//ВозвратПоставщику
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Истина КАК Выбран,
	|	Док.Ссылка КАК Документ
	|ИЗ
	|	(ВЫБРАТЬ Ссылка КАК Ссылка, СУММА(Коэффициент*Количество) КАК Количество ИЗ Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары ГДЕ ВозвратПоставщикуТовары.Номенклатура.ВидНоменклатуры<>&ВидНоменклатурыУслуга СГРУППИРОВАТЬ ПО Ссылка) КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ОстаткиТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Остатки
	|	ПО Док.Ссылка=Остатки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(-Количество) КАК Количество ИЗ РегистрНакопления.ПартииТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Партии
	|	ПО Партии.Регистратор=Остатки.Регистратор
	|ГДЕ 
	|	Док.Ссылка.Проведен И (Док.Количество<>ЕСТЬNULL(Остатки.Количество,0) ИЛИ Док.Количество<>ЕСТЬNULL(Партии.Количество,0))
	|	И НЕ 1 В (ВЫБРАТЬ 1 ИЗ РегистрСведений.ДопроведениеПоПартиям ГДЕ Регистратор=Док.Ссылка)
	|");
	Запрос.УстановитьПараметр("ВидНоменклатурыУслуга",Перечисления.ВидыНоменклатуры.Услуга);
	Индикатор=Индикатор+10; СтрокаСостояния="Возврат поставщику";
	ТаблицаВозвратПоставщику=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаблицаВозвратПоставщику Цикл
		ОбработкаПрерыванияПользователя();
		НоваяСтрока=ТаблицаДокументов.Добавить();
		НоваяСтрока.Выбран=Истина;
		НоваяСтрока.Документ=СтрокаТаблицы.Документ;
	КонецЦикла;
	
	//Инвентаризация
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Истина КАК Выбран,
	|	Док.Ссылка КАК Документ
	|ИЗ
	|	(ВЫБРАТЬ Ссылка КАК Ссылка, СУММА(ВЫБОР КОГДА Количество<0 ТОГДА -Количество ИНАЧЕ Количество КОНЕЦ) КАК Количество ИЗ Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары ГДЕ ИнвентаризацияТовары.Ссылка.Хозоперация<>&ХозОперацияИнвентаризацияТоваровОтданныхНаКомиссию СГРУППИРОВАТЬ ПО Ссылка) КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ОстаткиТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Остатки
	|	ПО Док.Ссылка=Остатки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ПартииТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Партии
	|	ПО Партии.Регистратор=Остатки.Регистратор
	|ГДЕ 
	|	Док.Ссылка.Проведен И (Док.Количество<>ЕСТЬNULL(Остатки.Количество,0) ИЛИ Док.Количество<>ЕСТЬNULL(Партии.Количество,0))
	|	И НЕ 1 В (ВЫБРАТЬ 1 ИЗ РегистрСведений.ДопроведениеПоПартиям ГДЕ Регистратор=Док.Ссылка)
	|");
	Запрос.УстановитьПараметр("ХозОперацияИнвентаризацияТоваровОтданныхНаКомиссию",Справочники.ХозОперации.ИнвентаризацияТоваровОтданныхНаКомиссию);
	Индикатор=Индикатор+10; СтрокаСостояния="Инвентаризация";
	ТаблицаИнвентаризация=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаблицаИнвентаризация Цикл
		ОбработкаПрерыванияПользователя();
		НоваяСтрока=ТаблицаДокументов.Добавить();
		НоваяСтрока.Выбран=Истина;
		НоваяСтрока.Документ=СтрокаТаблицы.Документ;
	КонецЦикла;

	//ПоступлениеТоваров
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Истина КАК Выбран,
	|	Док.Ссылка КАК Документ
	|ИЗ
	|	(ВЫБРАТЬ Ссылка КАК Ссылка, СУММА(КоличествоБазовое) КАК Количество ИЗ Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары ГДЕ ПоступлениеТоваровТовары.Номенклатура.ВидНоменклатуры<>&ВидНоменклатурыУслуга СГРУППИРОВАТЬ ПО Ссылка) КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ОстаткиТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Остатки
	|	ПО Док.Ссылка=Остатки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ПартииТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Партии
	|	ПО Партии.Регистратор=Остатки.Регистратор
	|ГДЕ 
	|	Док.Ссылка.Проведен И (Док.Количество<>ЕСТЬNULL(Остатки.Количество,0) ИЛИ Док.Количество<>ЕСТЬNULL(Партии.Количество,0))
	|	И НЕ 1 В (ВЫБРАТЬ 1 ИЗ РегистрСведений.ДопроведениеПоПартиям ГДЕ Регистратор=Док.Ссылка)
	|");
	Запрос.УстановитьПараметр("ВидНоменклатурыУслуга",Перечисления.ВидыНоменклатуры.Услуга);
	Индикатор=Индикатор+10; СтрокаСостояния="Поступление товаров";
	ТаблицаПоступлениеТоваров=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаблицаПоступлениеТоваров Цикл
		НоваяСтрока=ТаблицаДокументов.Добавить();
		НоваяСтрока.Выбран=Истина;
		НоваяСтрока.Документ=СтрокаТаблицы.Документ;
	КонецЦикла;
	
	//СписаниеТоваров
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Истина КАК Выбран,
	|	Док.Ссылка КАК Документ
	|ИЗ
	|	(ВЫБРАТЬ Ссылка КАК Ссылка, СУММА(Количество*Коэффициент) КАК Количество ИЗ Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары ГДЕ СписаниеТоваровТовары.Ссылка.Хозоперация<>&ХозОперацияСписаниеТоваровОтданныхНаКомиссию СГРУППИРОВАТЬ ПО Ссылка) КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ОстаткиТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Остатки
	|	ПО Док.Ссылка=Остатки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ПартииТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Партии
	|	ПО Партии.Регистратор=Остатки.Регистратор
	|ГДЕ 
	|	Док.Ссылка.Проведен И (Док.Количество<>ЕСТЬNULL(Остатки.Количество,0) ИЛИ Док.Количество<>ЕСТЬNULL(Партии.Количество,0))
	|	И НЕ 1 В (ВЫБРАТЬ 1 ИЗ РегистрСведений.ДопроведениеПоПартиям ГДЕ Регистратор=Док.Ссылка)
	|");
	Запрос.УстановитьПараметр("ХозОперацияСписаниеТоваровОтданныхНаКомиссию",Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию);
	Индикатор=Индикатор+10; СтрокаСостояния="Списание товаров";
	ТаблицаСписаниеТоваров=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаблицаСписаниеТоваров Цикл
		ОбработкаПрерыванияПользователя();
		НоваяСтрока=ТаблицаДокументов.Добавить();
		НоваяСтрока.Выбран=Истина;
		НоваяСтрока.Документ=СтрокаТаблицы.Документ;
	КонецЦикла;
	
	//РеализацияТоваров
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Истина КАК Выбран,
	|	Док.Ссылка КАК Документ
	|ИЗ
	|	(ВЫБРАТЬ Ссылка КАК Ссылка, СУММА(КоличествоБазовое) КАК Количество ИЗ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары ГДЕ РеализацияТоваровТовары.Номенклатура.ВидНоменклатуры<>&ВидНоменклатурыУслуга СГРУППИРОВАТЬ ПО Ссылка) КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ОстаткиТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Остатки
	|	ПО Док.Ссылка=Остатки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ПартииТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Партии
	|	ПО Партии.Регистратор=Остатки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.Продажи КАК РегистрНакопленияПродажи ГДЕ РегистрНакопленияПродажи.Номенклатура.ВидНоменклатуры<>&ВидНоменклатурыУслуга СГРУППИРОВАТЬ ПО Регистратор) КАК Продажи
	|	ПО Партии.Регистратор=Продажи.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ПартииТоваровОтданные СГРУППИРОВАТЬ ПО Регистратор) КАК ПартииТоваровОтданные
	|	ПО Партии.Регистратор=ПартииТоваровОтданные.Регистратор
	|ГДЕ 
	|	Док.Ссылка.Проведен И (Док.Количество<>ЕСТЬNULL(Остатки.Количество,0) ИЛИ Док.Количество<>ЕСТЬNULL(Партии.Количество,0) ИЛИ Док.Количество<>(ЕСТЬNULL(Продажи.Количество,0)+ЕСТЬNULL(ПартииТоваровОтданные.Количество,0)))
	|	И НЕ 1 В (ВЫБРАТЬ 1 ИЗ РегистрСведений.ДопроведениеПоПартиям ГДЕ Регистратор=Док.Ссылка)
	|");
	Запрос.УстановитьПараметр("ВидНоменклатурыУслуга",Перечисления.ВидыНоменклатуры.Услуга);
	Индикатор=Индикатор+10; СтрокаСостояния="Реализация товаров";
	ТаблицаРеализацияТоваров=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаблицаРеализацияТоваров Цикл
		НоваяСтрока=ТаблицаДокументов.Добавить();
		НоваяСтрока.Выбран=Истина;
		НоваяСтрока.Документ=СтрокаТаблицы.Документ;
	КонецЦикла;
	
	//ВозвратОтПокупателя
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Истина КАК Выбран,
	|	Док.Ссылка КАК Документ
	|ИЗ
	|	(ВЫБРАТЬ Ссылка КАК Ссылка, СУММА(КоличествоБазовое) КАК Количество ИЗ Документ.ВозвратОтПокупателя.Товары СГРУППИРОВАТЬ ПО Ссылка) КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ОстаткиТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Остатки
	|	ПО Док.Ссылка=Остатки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(ВЫБОР КОГДА Количество<0 ТОГДА -Количество ИНАЧЕ Количество КОНЕЦ) КАК Количество ИЗ РегистрНакопления.ПартииТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Партии
	|	ПО Партии.Регистратор=Остатки.Регистратор
	|ГДЕ 
	|	Док.Ссылка.Проведен И (Док.Количество<>ЕСТЬNULL(Остатки.Количество,0) ИЛИ Док.Количество<>ЕСТЬNULL(Партии.Количество,0))
	|	И НЕ 1 В (ВЫБРАТЬ 1 ИЗ РегистрСведений.ДопроведениеПоПартиям ГДЕ Регистратор=Док.Ссылка)
	|");
	Индикатор=Индикатор+10; СтрокаСостояния="Возврат от покупателя";
	ТаблицаВозвратОтПокупателя=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаблицаВозвратОтПокупателя Цикл
		ОбработкаПрерыванияПользователя();
		НоваяСтрока=ТаблицаДокументов.Добавить();
		НоваяСтрока.Выбран=Истина;
		НоваяСтрока.Документ=СтрокаТаблицы.Документ;
	КонецЦикла;
	
	//ПеремещениеТоваров
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Истина КАК Выбран,
	|	Док.Ссылка КАК Документ
	|ИЗ
	|	(ВЫБРАТЬ Ссылка КАК Ссылка, СУММА(ВЫБОР КОГДА Ссылка.Хозоперация=&ХозОперация ТОГДА КоличествоБазовое*2 ИНАЧЕ КоличествоБазовое КОНЕЦ) КАК Количество ИЗ Документ.ПеремещениеТоваров.Товары СГРУППИРОВАТЬ ПО Ссылка) КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ОстаткиТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Остатки
	|	ПО Док.Ссылка=Остатки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	(ВЫБРАТЬ Регистратор КАК Регистратор, СУММА(Количество) КАК Количество ИЗ РегистрНакопления.ПартииТоваровКомпании СГРУППИРОВАТЬ ПО Регистратор) КАК Партии
	|	ПО Партии.Регистратор=Остатки.Регистратор
	|	
	|ГДЕ 
	|	Док.Ссылка.Проведен И (Док.Количество<>ЕСТЬNULL(Остатки.Количество,0) ИЛИ Док.Количество<>ЕСТЬNULL(Партии.Количество,0))
	|	И НЕ 1 В (ВЫБРАТЬ 1 ИЗ РегистрСведений.ДопроведениеПоПартиям ГДЕ Регистратор=Док.Ссылка)
	|");
	Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ПеремещениеТоваров);
	Индикатор=Индикатор+10; СтрокаСостояния="Перемещение товаров";
	ТаблицаПеремещениеТоваров=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаблицаПеремещениеТоваров Цикл
		ОбработкаПрерыванияПользователя();
		НоваяСтрока=ТаблицаДокументов.Добавить();
		НоваяСтрока.Выбран=Истина;
		НоваяСтрока.Документ=СтрокаТаблицы.Документ;
	КонецЦикла;
	
	Индикатор=100;
	
	Возврат ТаблицаДокументов;
КонецФункции

// поиск задвоенных/затроенных... движений товарных регистр
Функция НайтиЗадвоенныеДвижения()
	ТаблицаДокументов=Новый ТаблицаЗначений();
	ТаблицаДокументов.Колонки.Добавить("Выбран");
	ТаблицаДокументов.Колонки.Добавить("Документ");
	
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Истина КАК Выбран,
	|	Регистратор КАК Документ
	|ИЗ
	|	(
	|	ВЫБРАТЬ
	|		Рег1.Регистратор
	|	ИЗ
	|		РегистрНакопления.ОстаткиТоваровКомпании КАК Рег1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании КАК Рег2
	|		ПО Рег1.Регистратор=Рег2.Регистратор
	|		И Рег1.ВидДвижения=Рег2.ВидДвижения
	|		И Рег1.Номенклатура=Рег2.Номенклатура
	|		И Рег1.СкладКомпании=Рег2.СкладКомпании
	|		И Рег1.ХарактеристикаНоменклатуры=Рег2.ХарактеристикаНоменклатуры
	|		И Рег1.ХозОперация=Рег2.ХозОперация
	|		И Рег1.Количество=Рег2.Количество
	|		И Рег1.СуммаРозн=Рег2.СуммаРозн
	|		И Рег1.Резерв=Рег2.Резерв
	|		И Рег1.НомерСтроки<>Рег2.НомерСтроки
	|
	|	ГДЕ
	|		НЕ Рег1.Регистратор ССЫЛКА Документ.ЗаказПокупателя
	|		И НЕ Рег1.Регистратор ССЫЛКА Документ.ЗаказВнутренний
	|		И НЕ Рег1.Регистратор ССЫЛКА Документ.ЗакрытиеСмены
	|
	|	СГРУППИРОВАТЬ ПО
	|		Рег1.Регистратор
	|
	|	ОБЪЕДИНИТЬ    
	|
	|	ВЫБРАТЬ
	|		Рег1.Регистратор
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровКомпании КАК Рег1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании КАК Рег2
	|		ПО Рег1.Регистратор=Рег2.Регистратор
	|		И Рег1.ВидДвижения=Рег2.ВидДвижения
	|		И Рег1.СкладКомпании=Рег2.СкладКомпании
	|		И Рег1.Номенклатура=Рег2.Номенклатура
	|		И Рег1.ХарактеристикаНоменклатуры=Рег2.ХарактеристикаНоменклатуры
	|		И Рег1.СтатусПартии=Рег2.СтатусПартии
	|		И Рег1.Партия=Рег2.Партия
	|		И Рег1.Количество=Рег2.Количество
	|		И Рег1.Сумма=Рег2.Сумма
	|		И Рег1.СуммаУпр=Рег2.СуммаУпр
	|		И Рег1.СуммаНДС=Рег2.СуммаНДС
	|		И Рег1.ХозОперация=Рег2.ХозОперация
	|		И Рег1.НомерСтроки<>Рег2.НомерСтроки
	|		
	|	ГДЕ
	|		НЕ Рег1.Регистратор ССЫЛКА Документ.ПересортицаТоваров
	|
	|	СГРУППИРОВАТЬ ПО
	|		Рег1.Регистратор
	|	) КАК Вн
	|	
	|УПОРЯДОЧИТЬ ПО Регистратор.Дата Возр
	|");
	ТаблицаДокументов=Запрос.Выполнить().Выгрузить();
	
	СтрокаСостояния="Обработка данных";
	ТаблицаДокументов.Свернуть("Выбран,Документ","");
	Возврат ТаблицаДокументов;
КонецФункции

// Выполняет удаление записей из таблицы регистрации изменений документов,
// которые не соответствуют регистрации по введенным правилам миграции при первом запуске
// после перехода на новую подсистему обменов
//
Функция НайтиРасхождениеРегистрацииИзменений() Экспорт

	// 1. выберем документы, у которых есть записи в таблицах регистрации
	Запрос = Новый Запрос;
	Запрос.Текст = ""; 
	МетаданныеДокументы = Метаданные.Документы;
	ПланОбменаМетаданные = Метаданные.ПланыОбмена.УдаленныеПодразделения;
	СоставПланаОбмена = ПланОбменаМетаданные.Состав;
	Инд = 0; 
	ТекстОбъединить = "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|";

	Для каждого МетаданныеДокумент Из МетаданныеДокументы Цикл
		Инд = Инд + 1;
		ИмяДокумента = МетаданныеДокумент.Имя;
		Если Инд = МетаданныеДокументы.Количество() Тогда
		    ТекстОбъединение = "";
		Иначе
			ТекстОбъединение = ТекстОбъединить;
		КонецЕсли; 
		Если НЕ СоставПланаОбмена.Содержит(МетаданныеДокумент) Тогда
		    Продолжить;
		КонецЕсли; 
		
        Запрос.Текст = Запрос.Текст +  
		"ВЫБРАТЬ
		|	" + ИмяДокумента + "Изменения.Узел КАК Узел,
		|	" + ИмяДокумента + "Изменения.НомерСообщения,
		|	" + ИмяДокумента + "Изменения.Ссылка КАК Документ
		|ИЗ
		|	Документ." + ИмяДокумента + ".Изменения КАК " + ИмяДокумента + "Изменения
		|ГДЕ
		|	" + ИмяДокумента + "Изменения.Узел ССЫЛКА ПланОбмена.УдаленныеПодразделения";
		
		Запрос.Текст =  Запрос.Текст + ТекстОбъединение;
	КонецЦикла;
	Запрос.Текст = Лев(Запрос.Текст,СтрДлина(Запрос.Текст)-18) + СтрЗаменить(Прав(Запрос.Текст,18),ТекстОбъединить,"");

	
	ТаблицаДокументов=Новый ТаблицаЗначений();
	ТаблицаДокументов.Колонки.Добавить("Выбран");
	ТаблицаДокументов.Колонки.Добавить("Документ");
    ТаблицаДокументов.Колонки.Добавить("УдалитьРегистрацию");
	ТаблицаДокументов.Колонки.Добавить("Узел");
	
	СтрокаСостояния = "Выборка регистрации изменений документов";
	ТаблицаРегистрации = Запрос.Выполнить().Выгрузить();
	ТекДокумент = Неопределено;
	Для Каждого СтрокаТаблицы Из ТаблицаРегистрации Цикл
		ОбработкаПрерыванияПользователя();
				
		Если ТекДокумент <> СтрокаТаблицы.Документ Тогда
			МетаданныеОбъекта = СтрокаТаблицы.Документ.Метаданные();
			ЭтоУдаление = (ТипЗнч(СтрокаТаблицы.Документ) = Тип("УдалениеОбъекта"));
			МассивУзлов = одОбменДанными.ПолучитьМассивУзловОбмена(СтрокаТаблицы.Документ,,,ПланОбменаМетаданные,МетаданныеОбъекта,ЭтоУдаление);
			ТекДокумент = СтрокаТаблицы.Документ;
		КонецЕсли; 
		
		НайденУзел = МассивУзлов.Найти(СтрокаТаблицы.Узел); 
		Если НайденУзел = неопределено Тогда
			НоваяСтрока 			= ТаблицаДокументов.Добавить();
			НоваяСтрока.Выбран		= Истина;
			НоваяСтрока.Документ	= СтрокаТаблицы.Документ;
			НоваяСтрока.Узел		= СтрокаТаблицы.Узел;
        КонецЕсли; 
			
	КонецЦикла;
		
	Возврат ТаблицаДокументов;
	
КонецФункции

// процедура поиска
Процедура Искать() Экспорт
	// чистим состав
	Состав.Очистить();
	
	// непроведенные документы с движениями
	Если ДвиженияНепроведенныхДокументов Тогда
		СтрокаСостояния="Поиск непроведенных документов с движениями"; Индикатор=0;
		ТаблицаДокументов=НайтиНеПроведенныеДокументыСДвижениями();
		ЗаполнитьСостав(ТаблицаДокументов,"УдалитьДвижения");
	КонецЕсли;
	
	// проведенные документы без движений
	Если ПроведенныеДокументыБезДвижений Тогда
		СтрокаСостояния="Поиск проведенных документов без движений"; Индикатор=0;
		ТаблицаДокументов=НайтиПроведенныеДокументыБезДвижений(); Индикатор=0;
		СтрокаСостояния="Заполнение таблицы состава";
		ЗаполнитьСостав(ТаблицаДокументов,"Провести");
	КонецЕсли;
	
	// расхождения товарных движений
	Если РасхождениеТоварныхРегистров Тогда
		СтрокаСостояния="Поиск несоответствий движений"; Индикатор=0;
		ТаблицаДокументов=НайтиРасхожденияТоварныхРегистров(); Индикатор=0;
		СтрокаСостояния="Заполнение таблицы состава";
		ЗаполнитьСостав(ТаблицаДокументов,"Провести");
	КонецЕсли;
	
	// задвоенные/затроенные... движения товарных регистр
	Если ЗадвоенныеДвижения Тогда
		СтрокаСостояния="Поиск задвоенных движений"; Индикатор=0;
		ТаблицаДокументов=НайтиЗадвоенныеДвижения(); Индикатор=0;
		СтрокаСостояния="Заполнение таблицы состава";
		ЗаполнитьСостав(ТаблицаДокументов,"Провести");
	КонецЕсли;
	
	Если РасхождениеРегистрацииИзменений Тогда
		СтрокаСостояния="Поиск расхождения регистрации изменений"; Индикатор=0;
		ТаблицаДокументов=НайтиРасхождениеРегистрацииИзменений(); Индикатор=0;
		СтрокаСостояния="Заполнение таблицы состава";
		ЗаполнитьСостав(ТаблицаДокументов,"УдалитьРегистрацию");
	КонецЕсли;
	
	СтрокаСостояния="Поиск завершен"; Индикатор=100;
КонецПроцедуры

//// ошибки пересчета базового количества
//Функция НайтиДокументыСНеСоответствующимБазовымКоличеством()
//	ТекстЗапроса="";
//	Для Каждого Документ Из Метаданные.Документы Цикл
//		ОбработкаПрерыванияПользователя();
//		Попытка Реквизит=Документ.ТабличныеЧасти.Товары.Реквизиты.КоличествоБазовое; Исключение Продолжить; КонецПопытки;
//		ТекстЗапроса=ТекстЗапроса+"
//		|"+?(ПустаяСтрока(ТекстЗапроса),"","ОБЪЕДИНИТЬ")+"
//		|
//		|ВЫБРАТЬ
//		|	Истина КАК Выбран,
//		|	ДокТовары.Ссылка КАК Документ
//		|ИЗ
//		|	Документ."+Документ.Имя+".Товары КАК ДокТовары
//		|ГДЕ
//		|   ДокТовары.Коэффициент*ДокТовары.Количество<>ДокТовары.КоличествоБазовое";
//	КонецЦикла;
//	Запрос=Новый Запрос(ТекстЗапроса);
//	ТаблицаДокументов=Запрос.Выполнить().Выгрузить();
//	ТаблицаДокументов.Свернуть("Выбран,Документ","");
//	Возврат ТаблицаДокументов;
//КонецФункции

//// ошибки пересчета цен и сумм
//Функция НайтиДокументыСОшибочнымиЦенамиИСуммами()
//	СписокКорректируемыхДокументов=Новый СписокЗначений();
//	СписокКорректируемыхДокументов.Добавить("ВозвратОтПокупателя");
//	СписокКорректируемыхДокументов.Добавить("ВозвратПоставщику");
//	СписокКорректируемыхДокументов.Добавить("ЗаказВнутренний");
//	СписокКорректируемыхДокументов.Добавить("ЗаказПокупателя");
//	СписокКорректируемыхДокументов.Добавить("ЗаказПоставщику");
//	СписокКорректируемыхДокументов.Добавить("ОтчетКомиссионера");
//	СписокКорректируемыхДокументов.Добавить("ОтчетКомитенту");
//	СписокКорректируемыхДокументов.Добавить("ПоступлениеТоваров");
//	СписокКорректируемыхДокументов.Добавить("СчетОтПоставщика");
//	СписокКорректируемыхДокументов.Добавить("ПоступлениеДопРасходов");
//	СписокКорректируемыхДокументов.Добавить("РеализацияТоваров");
//	СписокКорректируемыхДокументов.Добавить("СчетНаОплату");
//	СписокКорректируемыхДокументов.Добавить("СчетФактураВыданный");
//	СписокКорректируемыхДокументов.Добавить("СчетФактураПолученный");
//	
//	ТекстЗапроса="";
//	Для Каждого Документ Из Метаданные.Документы Цикл
//		Если СписокКорректируемыхДокументов.НайтиПоЗначению(Документ.Имя)=Неопределено Тогда Продолжить; КонецЕсли;
//		Попытка РеквизитыТЧ=Документ.ТабличныеЧасти.Товары.Реквизиты; Исключение Продолжить; КонецПопытки;
//		
//		ЕстьЦенаСумма=Ложь; ЕстьЦенаСуммаРозн=Ложь;
//		Попытка
//			Реквизит=РеквизитыТЧ.Цена; Реквизит=РеквизитыТЧ.Сумма;
//			ЕстьЦенаСумма=Истина;
//		Исключение
//			ЕстьЦенаСумма=Ложь;
//		КонецПопытки;
//		Попытка
//			Реквизит=РеквизитыТЧ.ЦенаРозничная; Реквизит=РеквизитыТЧ.СуммаРозничная;
//			ЕстьЦенаСуммаРозн=Истина;
//		Исключение
//			ЕстьЦенаСуммаРозн=Ложь;
//		КонецПопытки;
//		
//		Если НЕ ЕстьЦенаСумма И НЕ ЕстьЦенаСуммаРозн Тогда Продолжить; КонецЕсли;
//		
//		ТекстЗапроса=ТекстЗапроса+"
//		|"+?(ПустаяСтрока(ТекстЗапроса),"","ОБЪЕДИНИТЬ")+"
//		|
//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	Истина КАК Выбран,
//		|	ДокТовары.Ссылка КАК Документ
//		|ИЗ
//		|	Документ."+Документ.Имя+".Товары КАК ДокТовары
//		|ГДЕ
//		|	ДокТовары.Количество>0 И НЕ ДокТовары.Количество ЕСТЬ NULL";
//		
//		Если ЕстьЦенаСумма Тогда
//			ТекстЗапроса=ТекстЗапроса+"
//			|	И (НЕ ((ВЫРАЗИТЬ(ДокТовары.Сумма/ДокТовары.Количество КАК Число(15,2)))
//			|	-ДокТовары.Цена МЕЖДУ -0.01 И 0.01)"+?(ЕстьЦенаСуммаРозн," ИЛИ ",")");
//		КонецЕсли;
//		Если ЕстьЦенаСуммаРозн Тогда
//			ТекстЗапроса=ТекстЗапроса+"
//			|	НЕ ((ВЫРАЗИТЬ(ДокТовары.СуммаРозничная/ДокТовары.Количество КАК Число(15,2)))
//			|	-ДокТовары.ЦенаРозничная МЕЖДУ -0.01 И 0.01))";
//		КонецЕсли;
//	КонецЦикла;
//	Запрос=Новый Запрос(ТекстЗапроса);
//	ТаблицаДокументов=Запрос.Выполнить().Выгрузить();
//	ТаблицаДокументов.Свернуть("Выбран,Документ","");
//	Возврат ТаблицаДокументов;
//КонецФункции

///////////////////////////////////////////////////////////////////////	
// ИСПРАВЛЕНИЕ
///////////////////////////////////////////////////////////////////////

// Исправляет базовое количество
Процедура ИсправитьБазовоеКоличество() Экспорт
	//Для Каждого СтрокаСостав Из Состав Цикл
	//	Если НЕ СтрокаСостав.Выбран Тогда Продолжить; КонецЕсли;
	//	
	//	Об=СтрокаСостав.Документ.ПолучитьОбъект();
	//	Для Каждого СтрокаТовар Из Об.Товары Цикл
	//		Если СтрокаТовар.Количество*СтрокаТовар.Коэффициент<>СтрокаТовар.КоличествоБазовое Тогда
	//			СтрокаТовар.КоличествоБазовое=СтрокаТовар.Количество*СтрокаТовар.Коэффициент;
	//			Об.ОбработкаРеквизита("Товары.КоличествоБазовое",СтрокаТовар);
	//		КонецЕсли;
	//	КонецЦикла;
	//	Попытка
	//		Если Об.Проведен Тогда
	//			Об.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	//		Иначе
	//			Об.Записать(РежимЗаписиДокумента.Запись);
	//		Конецесли;
	//		Сообщить(СокрЛП(Об)+" - обновлено базовое количество!",СтатусСообщения.Информация);
	//	Исключение
	//		Сообщить(СокрЛП(Об)+" - НЕ УДАЛОСЬ обновить базовое количество!",СтатусСообщения.Важное);
	//	КонецПопытки;
	//КонецЦикла;
КонецПроцедуры

// Исправляет цены и суммы
Процедура ИсправитьЦеныИСуммы() Экспорт
	//Для Каждого СтрокаСостав Из Состав Цикл
	//	Если НЕ СтрокаСостав.Выбран Тогда Продолжить; КонецЕсли;
	//	
	//	Об=СтрокаСостав.Документ.ПолучитьОбъект();
	//	Для Каждого СтрокаТовар Из Об.Товары Цикл
	//		Об.ОбработкаРеквизита("Товары.Количество",СтрокаТовар);
	//	КонецЦикла;
	//	Попытка
	//		Если Об.Проведен Тогда
	//			Об.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	//		Иначе
	//			Об.Записать(РежимЗаписиДокумента.Запись);
	//		Конецесли;
	//		Сообщить(СокрЛП(Об)+" - обновлены цены и суммы документа!",СтатусСообщения.Информация);
	//	Исключение
	//		Сообщить(СокрЛП(Об)+" - НЕ УДАЛОСЬ цены и суммы документа!",СтатусСообщения.Важное);
	//	КонецПопытки;
	//КонецЦикла;
	
КонецПроцедуры

// Удаление движений не проведенных документов
Процедура УдалитьДвиженияНеПроведенныхДокументов() Экспорт
	//Для Каждого СтрокаСостав Из Состав Цикл
	//	Если НЕ СтрокаСостав.Выбран Тогда Продолжить; КонецЕсли;
	//	Док=СтрокаСостав.Документ;
	//	Для Каждого Регистр Из Док.Метаданные().Движения Цикл
	//		Попытка
	//			НаборЗаписей=РегистрыНакопления[Регистр.Имя].СоздатьНаборЗаписей();
	//		Исключение
	//			Продолжить;
	//		КонецПопытки;
	//		НаборЗаписей.Отбор.Регистратор.Значение=Док;
	//		НаборЗаписей.Отбор.Регистратор.Использование=Истина;
	//		НаборЗаписей.Записать();
	//		Сообщить(СокрЛП(Док)+" - удалены движения по регистру "+СокрЛП(Регистр.Синоним),СтатусСообщения.Важное);
	//	КонецЦикла;
	//КонецЦикла;
КонецПроцедуры

// Установить пометку
Процедура СоставПометить(Пометка=Истина) Экспорт
	Для Каждого СтрокаСостав Из Состав Цикл
		СтрокаСостав.Выбран=Пометка;
	КонецЦикла;
КонецПроцедуры

// исправляет косяки
Процедура Исправить() Экспорт
	Индикатор=0; Сч=0; ВсегоСтрок=Состав.Количество();
	ТекДокумент = Неопределено;
    ПланОбменаМетаданные = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().Ссылка.Метаданные();
	Для Каждого СтрокаДок Из Состав Цикл
		// индикация
		ОбработкаПрерыванияПользователя();
		СтрокаСостояния=СокрЛП(СтрокаДок.Документ);
		Индикатор=Цел((Сч/ВсегоСтрок)*100);
		Сч=Сч+1;
		// пропускаем не помеченные
		Если НЕ СтрокаДок.Выбран Тогда Продолжить; КонецЕсли;
		
		Док=СтрокаДок.Документ.ПолучитьОбъект();
		
		// исправляем количества и суммы
		Если СтрокаДок.ПересчитатьКоличество ИЛИ СтрокаДок.ПересчитатьСумму Тогда
		КонецЕсли;		
		
		// удаляем движения непроведенного
		Если СтрокаДок.УдалитьДвижения Тогда
			Для Каждого Регистр Из Док.Метаданные().Движения Цикл
				Попытка
					НаборЗаписей=РегистрыНакопления[Регистр.Имя].СоздатьНаборЗаписей();
				Исключение
					Продолжить;
				КонецПопытки;
				НаборЗаписей.Отбор.Регистратор.Значение=Док.Ссылка;
				НаборЗаписей.Отбор.Регистратор.Использование=Истина;
				НаборЗаписей.Записать();
				Сообщить(СокрЛП(Док)+" - удалены движения по регистру "+СокрЛП(Регистр.Синоним),СтатусСообщения.Важное);
			КонецЦикла;
		КонецЕсли;
		
		// перепроводим
		Если СтрокаДок.Провести Тогда
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки(),СтатусСообщения.Важное);
			КонецПопытки;
		КонецЕсли;
		
		// удаляем регистрацию изменений, там где ее быть не должно
		Если СтрокаДок.УдалитьРегистрацию Тогда
			// удалим регистрацию самого документа
			Попытка
				ПланыОбмена.УдалитьРегистрациюИзменений(СтрокаДок.Узел,СтрокаДок.Документ);
				Сообщить(СокрЛП(Док)+": удалена регистрация изменений по узлу " + СокрЛП(СтрокаДок.Узел),СтатусСообщения.Информация);
			Исключение
				Сообщить(СокрЛП(Док)+": ошибка при удалении регистрации по узлу " + СокрЛП(СтрокаДок.Узел) 
				+ ": " + ОписаниеОшибки(),СтатусСообщения.Важное);
			КонецПопытки;
			
			Если ТекДокумент <> СтрокаДок.Документ Тогда
			    МетаданныеДвижения = СтрокаДок.Документ.Метаданные().Движения;
				ТекДокумент = СтрокаДок.Документ;
			КонецЕсли; 
			
			// и его движений
			Для Каждого Регистр Из МетаданныеДвижения Цикл 
				Если Док = Неопределено Тогда
				   Продолжить;
				КонецЕсли; 
				ЭлементСостава = ПланОбменаМетаданные.Состав.Найти(Регистр);
				Регистрировать = Ложь;
				Если НЕ ЭлементСостава = Неопределено Тогда
					Если ЭлементСостава.АвтоРегистрация = АвтоРегистрацияИзменений.Запретить Тогда
						Регистрировать = Истина; // есть в составе плана обмена и стоит запрет авторегистрации
					КонецЕсли; 
				КонецЕсли;
				Если НЕ Регистрировать Тогда
				    Продолжить;
				КонецЕсли; 
				ТекНаборЗаписей = Док.Движения[Регистр.Имя];
				Попытка
					ПланыОбмена.УдалитьРегистрациюИзменений(СтрокаДок.Узел,ТекНаборЗаписей);
					Сообщить(СокрЛП(Док)+": удалена регистрация изменений движений по узлу " + СокрЛП(СтрокаДок.Узел),СтатусСообщения.Информация);
				Исключение
					Сообщить(СокрЛП(Док)+": ошибка при удалении регистрации движений по узлу " + СокрЛП(СтрокаДок.Узел) 
					+ ": " + ОписаниеОшибки(),СтатусСообщения.Важное);
				КонецПопытки;
			КонецЦикла;

		КонецЕсли; 
		
	КонецЦикла;	
    Индикатор = 100;
	
КонецПроцедуры

#КонецЕсли
